import React from 'react'
import {FaRegSmile, FaSmileWink} from 'react-icons/fa';

export default function About() {
    return (
        <>
            <div className="bf"/>

            <div className="about">
                
                <article className="down">
                    <div className="focused"/>
                    <h2>למה בחרתי להתעסק בבניית אתרים?</h2>
                    <h5>אני יצירתית, אוהבת להרכיב פאזלים ולפתור תוכנות, וגם להתעסק במילים וצבעים. בניית אתרים משלבת את כל הדברים האלו, ויכולה להיות פרנסה משמחת עבורי, תוך כדי יצירה אישית ומעניינת - עבור מישהו אחר <FaRegSmile style={{fontSize:'1rem'}}/></h5>
                </article>
                <article className="up">
                    <h2>למה לבחור בי לבניית האתר שלכם?</h2>
                    <ul>
                        <li>
                            <h5>מקצועיות - אני בוגרת תואר ראשון בפסיכולוגיה ומדעי המחשב ובעלת ניסיון בבניית אתרים.</h5>
                        </li>
                        <li>
                            <h5>יחס אישי - דווקא בגלל שאני צעירה בתחום, יש לי את ההתרגשות להשקיע באתר לפחות כאילו הוא ירק בגינה שלי. אני באמת אהיה אתכם בתהליך, ואהנה מליצור אתר בעל אופי שיתאים לכם בדיוק.</h5>
                        </li>
                        <li>
                            <h5>מחירי השקה משתלמים - גם המחירים עוד צעירים ורעננים <FaSmileWink style={{fontSize:'1rem'}}/></h5>
                        </li>
                        <li>
                            <h5>צבעוניות - אני מתרגלת כתיבה באוניברסיטה של החיים מאז כיתה א', ומרגישה בשלה לעבור לכתיבה שיווקית עבור הסכום הנכון, כך שאוכל לעזור לכם גם בתחום הזה.</h5>
                        </li>
                    </ul>
                </article>
            </div>

            <div className="af"/>
        </>
    )
}
