import React from 'react'

export default function Start() {
    return (
        <>
        <div className="blue-spikes"/>
        <section className="sec">
            <h2>אזזז... מאיפה מתחילים?</h2>
            <h5>קודם כל נתאם פגישת היכרות בה נבין את הצרכים והרצונות שלכם. נאפיין יחד את האתר המבוקש, ונבנה את תהליך העבודה הנכון ביותר.</h5>
            <h5>זו לא חייבת להיות פגישה פיזית, כמו שלמדנו מהקורונה – אפשר לעשות היום הכול גם בטלפון או בזום. העיקר שנכיר, נבין, ונתאם ציפיות יחד.</h5>
        </section>
        </>
    )
}
