import React from 'react'
import Fade from 'react-reveal/Fade';
import Roll from 'react-reveal/Roll';

export default function About() {
    return (
        <>
            <h1 style={{textAlign: 'right', marginRight:'27%'}}>קצת עלי</h1>

            <div className="about">
                    <Roll bottom>
                        <div className="focused"/>
                    </Roll>

                    <article className="right centerr">
                        <Fade bottom>
                            <h3>היי, אני יוני.</h3>
                            <p>
                                מפתחת אתרים וכותבת תוכן. אני כאן כדי לעזור לעסק שלך לעבור לגור באינטרנט - בארמון דיגיטלי שיודע להפוך גולש חולף, ללקוח שמשלם.
                            </p>
                            <br/>
                            <p>
                                פתחתי עסק משלי כי אני אוהבת לתכנן את המשימות ביעילות וגמישות ללא בוסים גדולים; לעבוד מהלב עבור אנשים. בזמן שאני מגשימה את חלום העצמאות שלי - כל אתר מקדם בעצמו חלום אחר: בין אם זו חנות שהיא מפעל חייו של הלקוח, ספר שלקוחה כתבה על מסע שעברה, או אג'נדות שחשוב לקדם.
                            </p>
                            <br/>
                            <p>לכל אתר יש סיפור, ואני אשמח לעזור לספר את הסיפור שלך באופן מיטבי.</p>
                        </Fade>
                    </article>

                    <article className="left centerr">
                        <Fade bottom>
                            <h3>למה לצאת לדרך דווקא איתי?</h3>
                                <p>
                                    אני מציעה פתרון עוטף לבניית האתר: מיקוד הצרכים, הסברים בגובה העיניים, ליווי עד לעליית האתר והדרכה בסיום. אפשר לשלב גם כתיבת תוכן: כתיבה שיווקית לאתר וכתיבת מאמרים לקידום seo, כך שעוד חלק משמעותי מהתהליך – יוסר מדאגותיך 😊
                                </p>
                                <br/>
                                <p>
                                    העבודה איתי היא קרקע לצמיחה משותפת, מתוך הזדהות: גם אני מנהלת עסק ומתמודדת עם הקשיים שהעסק שלך נתקל בהם. בפחד מבזבוז תקציבים על המשאבים הלא נכונים, בהתלבטויות איך ולאן לצמוח. לכן אני יודעת לייעץ במה להתמקד ועל מה לוותר, באיזו שפה וויזואלית לבחור, וכמובן – לתת מחיר הוגן עבור התמורה, כמו שהייתי רוצה לקבל.
                                </p>
                                <br/>
                                <p>
                                    העסק שלי הוא בוטיק וקטן. בשונה מפסי ייצור תעשייתיים, כאן כל פרויקט הוא עולם ומלואו שמקבל מקסימום תשומת לב. אתכנן יחד איתך את התהליך ואדאג שהיצירה תתבצע מתוך הקשבה, עד לתוצאה המושלמת.
                                    והחלק הכי טוב? התוצאה עבורך היא גם תוצאה עבורי: כל אתר הופך להיות אצלי מוצר דגל בחלון הראווה, כך שיש לי את כל הסיבות להשקיע באתר שלך מכל הלב.
                                </p>
                        </Fade>
                    </article>                      

                    <Roll bottom>
                        <div className="choose"/>
                    </Roll>
            </div>
        </>
    )
}
