import React from 'react'
import Fade from 'react-reveal/Fade';
import Roll from 'react-reveal/Roll';

export default function About() {
    return (
        <>
            <h1 style={{textAlign: 'right', marginRight:'27%'}}>
                קצת עלי
            </h1>

            <div className="about">
                <Roll bottom>
                    <div className="me"/>
                </Roll>

                <article className="right centerr">
                    <Fade bottom>
                        <h2>היי, אני יוני.</h2>

                        <p>
                            מפתחת ובונה אתרים, עם אהבה לסדר, צבעים ופתרון חידות טכנולוגיות.
                        </p>

                        <br/>

                        <p>
                            פתחתי עסק משלי כי אני אוהבת לעבוד בגמישות, מהלב ובגובה העיניים. בזמן שאני מגשימה את חלום העצמאות שלי, כל אתר מקדם חלום אחר: חנות שהיא מפעל חיים, ספר שמספר מסע אישי, אג'נדה שחשוב לקדם, או מערכת שעוזרת לילדים ללמוד מרחוק.
                        </p>

                        <br/>

                        <p>
                            ואני פשוט אשמח לעזור גם לחלום שלך לעבוד כמו שצריך :)
                        </p>
                    </Fade>
                </article>

                <article className="left centerr">
                    <Fade bottom>
                        <h2>למה לצאת לדרך דווקא איתי?</h2>

                        <p>
                            אני מציעה ליווי מקצה לקצה: אפיון הצרכים, תכנון, עיצוב ובנייה, שדרוג אתרים קיימים, פיתוח מותאם בקוד כשצריך, והדרכה לניהול האתר. בעצם אני מציעה ליווי גם לאחר הסיום... אפשר לשלב ניהול, תחזוקה, עדכונים ושינויים כדי שהאתר יישאר חי, מסודר ורלוונטי.
                        </p>

                        <br/>

                        <p>
                            היתרון שלי הוא השילוב בין WordPress נוח לניהול לבין התאמות בקוד שמאפשרות לאתר להתאים לעסק, ולא להפך.
                            ככה אפשר להשתמש במה שכבר עובד טוב, לפתח רק את מה שחסר באמת, ולחסוך זמן, עבודה והוצאות :)
                        </p>

                        <br/>

                        <p>
                            העסק שלי הוא בוטיק וקטן. אין כאן פס ייצור, אלא עבודה אישית, הקשבה ותשומת לב לפרטים הקטנים, עד לתוצאה מדויקת שאפשר להתגאות בה.
                        </p>
                    </Fade>
                </article>

                <Roll bottom>
                    <div className="choose"/>
                </Roll>
            </div>

            <div className="sec" style={{backgroundColor:'wheat'}}>
                <article className="ycube">
                    <Roll bottom>
                        <div className="logoa"/>
                    </Roll>
                </article>

                <Fade bottom>
                    <article className="centerr">
                        <h2>למה קוביה?</h2>

                        <p>
                            תמיד אהבתי לפתור פאזלים, וגם להתעסק במילים וצבעים. אני מתה על לעשות סדר בבלגן, לשבץ כל חלק לתיקיה הנכונה ואז לשלוף אותו בזמן ובמקום שלו. כיף לראות איך מכל הפרטים הקטנים, נוצרת תמונה מושלמת. הקובייה ההונגרית שמדגמנת בלוגו – נראית אולי כמו סיוט עבור מי שלא יודע איך לגשת, אבל מי שמכיר את הנוסחה? יכול לפתור אותה תיקתק.
                        </p>

                        <br/>

                        <p>
                            בניית אתר עלולה להיראות כך בתחילת התהליך. קשה להחליט במי לבחור למשימה הזו כשלא יודעים מה בכלל צריך, או להבין מההצעות שקיבלת - מה הציעו לך באמת. והיא גם פאזל מורכב וצבעוני: החל משלב האפיון על פי משאלות הלקוח, דרך הרכבה של הטכנולוגיות החדשניות ביותר, ועד לעיצוב המושלם.
                        </p>

                        <p>
                            למדתי את הנוסחה, ואני יכולה להסביר גם לך.

                            <a
                                href="https://api.whatsapp.com/send?phone=972556617145"
                                style={{margin:'10px', color:'var(--lgreen)'}}
                                rel="noopener noreferrer"
                                target="_blank"
                            >
                                שנדבר?
                            </a>
                        </p>
                    </article>
                </Fade>
            </div>
        </>
    )
}