import React from 'react'
import Fade from 'react-reveal/Fade';
import map from '../../images/blog/ship/map.png'
import p1 from '../../images/blog/ship/משלוח.png'
import p2 from '../../images/blog/ship/משלוח1.png'
import p3 from '../../images/blog/ship/משלוח2.png'
import p4 from '../../images/blog/ship/משלוח3.png'
import p5 from '../../images/blog/ship/משלוח4.png'
import p6 from '../../images/blog/ship/משלוח5.png'
import p7 from '../../images/blog/ship/משלוח6.png'
import p8 from '../../images/blog/ship/משלוח7.png'
import p9 from '../../images/blog/ship/משלוח8.png'
import p10 from '../../images/blog/ship/משלוח9.png'

export default function Shipping () {
    return (
        <>
                <Fade bottom>
                    <div className="post-cotain">
                        <h2>איך להגדיר משלוחים בווקומרס?</h2>

                        <div style={{textAlign:'center'}} >
                            <img className='post-img' src={map} alt="fix the site icon"/>
                        </div>

                        <p>
                            במדריך הבא נלמד להגדיר אזורי משלוח ולהתאים את סוגי המשלוח והמחירים. נעבור גם על איך לכבות שיטת משלוח שכבר פועלת, או לערוך אותה. המדריך מתאים לאתר מכירה שנבנה עם Woocommerce במערכת הניהול של וורדפרס.                             </p>
                        <p>
                            מתחילים!
                        </p>
                        <ol>
                            <li>
                                <strong>אמא'לה, איפה אנחנו?</strong>
                                <br/>
                                בלוח הבקרה נחפש את 'ווקומרס' > הגדרות > נעבור ללשונית 'משלוח'. בחירת הלשוניות שבתוך ההגדרות, נמצאת בשורה העליונה. לא צריך לגלול מטה בחיפוש המשלוחים.
                            </li>
                            <img className='post-screenshot' src={p1} alt="screenshot-guide"/>
                            <li>
                                לפני שמתחילים, נבין מהו <strong>אזור משלוח</strong>
                                <br/>
                                <ul>
                                    <li>זהו אזור גיאוגרפי בו מוגדרות שיטות משלוח שאפשר להשתמש בהן באותו אזור. ניתן להגדיר מספר אזורי משלוח, עם שיטות משלוח שונות בתוכם – למשל, עבור משלוחים בישראל ניתן ללקוח לבחור דואר או שליח עד הבית, לעומת זאת לאירופה המשלוח יתבצע רק בדואר, ולאמריקה לא יתאפשר לשלוח כלל.</li>
                                    <li>ווקומרס יתאים את האזור ללקוח לפי כתובת המשלוח שלו ויציג את שיטות המשלוח הרלוונטיות לאזור זה, מהן יוכל הלקוח לבחור.</li>
                                </ul>
                            </li>
                            <li>
                                <strong>'מיקומים אשר אינם כלולים באזורים אחרים'</strong>
                                <br/>
                                אם החנות מציעה משלוחים לכל העולם, חשוב להגדיר גם שיטת משלוח ברירת לאזורים אותם לא הגדרנו ספציפית. בדוגמה שבתמונה זו תהיה ברירת המחדל לכל הארצות חוץ מישראל. אם לא נגדיר גם ברירת מחדל, לא תהיה אפשרות להזמין לחו''ל.
                            </li>
                            <img className='post-screenshot' src={p2} alt="screenshot-guide"/>
                            <li>
                                הוספת <strong>אזור משלוח</strong>
                                <br/>
                                בלחיצה על 'הוסף אזור משלוח' מהתמונה הקודמת, יפתח החלון הבא:
                                <ul>
                                    <li>
                                        נגדיר אותו – בדוגמה שלנו האזור מוגדר כמדינת ירדן.
                                    </li>
                                    <li>
                                        נלחץ על 'הוסף שיטת משלוח'.
                                    </li>
                                </ul>
                            </li>
                            <img className='post-screenshot' src={p3} alt="screenshot-guide"/>
                            <li>
                                הוספת <strong>שיטת משלוח</strong>
                                <br/>
                                נבחר בשיטה הראשונה - משלוח בתעריף קבוע (בסעיפים הבאים נעבור על שאר השיטות). 
                                <br/>
                                נשמור בלחיצה על 'הוסף שיטת משלוח'.
                            </li>
                            <img className='post-screenshot-small' src={p4} alt="screenshot-guide"/>
                            <li>
                                עריכת <strong>שיטת משלוח</strong>
                                <br/>
                                לאחר ששמרנו נלחץ על 'עריכה' מתחת לתעריף הקבוע, כדי להגדיר את שיטת המשלוח בצורה יותר מדויקת.
                            </li>
                            <img className='post-screenshot' src={p5} alt="screenshot-guide"/>
                            <li>
                                הגדרת שיטת המשלוח <strong>תעריף קבוע</strong>
                                <br/>
                                <ul>
                                    <li>
                                        כותרת – שם שיטת המשלוח הספציפית, למשל 'שליח עד הבית' או 'דואר ישראל'.
                                    </li>
                                    <li>
                                        סטטוס מס – לפי מה שרלוונטי לחנות ולאזור המשלוח שלכם.
                                    </li>
                                    <li>
                                        עלות – מחיר המשלוח בשיטה זו, במטבע בו מוגדרת החנות. במקרה שלנו 100 זאת אומרת מאה שקלים, אין צורך להזין כאן מטבע.
                                    </li>
                                    <li>
                                        נשמור את השינויים.
                                    </li>
                                </ul>
                            </li>
                            <img className='post-screenshot' src={p6} alt="screenshot-guide"/>
                            <li>
                                הגדרת שיטת המשלוח <strong>איסוף מקומי</strong>
                                <br/>
                                <ul>
                                    <li>
                                        נחזור על סעיף 5,  כשהפעם נבחר באיסוף מקומי. 
                                    </li>
                                    <li>
                                        נשמור, ובדומה לסעיף 6 נלחץ על 'עריכה' מתחת לאיסוף המקומי.
                                    </li>
                                    <li>
                                        כותרת – כדאי לציין כאן מאיפה האיסוף יתבצע. 
                                        לעיתים יש מספר יעדים לאיסוף עצמי: נוסיף שיטת משלוח עבור כל אחד מהם ונציין כתובת איסוף שונה בתוך כותרת שיטת המשלוח.
                                    </li>
                                    <li>
                                        נזין סטטוס מס ועלות (כמו בסעיף 7).
                                    </li>
                                    <li>
                                        נשמור את השינויים.
                                    </li>
                                </ul>
                            </li>
                            <img className='post-screenshot' src={p7} alt="screenshot-guide"/>
                            <li>
                                הגדרת שיטת המשלוח <strong>משלוח חינם</strong>
                                <br/>
                                <ul>
                                    <li>שוב נחזור על סעיף 5 והפעם נבחר במשלוח חינם, נשמור ונכנס לעריכה.</li>
                                    <li>כותרת – מומלץ להזין כותרת שמסבירה את המחיר, למשל – 'משלוח חינם בהזמנה מעל 200 ₪'</li>
                                    <li>
                                        משלוח חינם מחייב – נבחר תנאי למשלוח החינמי, אם יש כזה. כמובן שאפשר גם סתם לפרגן במשלוח חינם 😊
                                        אם יש תנאי, למשל כמות הזמנה מינימאלית: בשדה הבא נזין את הסכום המינימלי.
                                    </li>
                                    <li>נחליט האם הסכום המינימלי הוא לפני או אחרי הנחה, ונסמן v בהתאם.</li>
                                    <li>
                                        נשמור את השינויים.
                                    </li>
                                </ul>
                            </li>
                            <img className='post-screenshot' src={p8} alt="screenshot-guide"/>
                            <li>
                                סיכום – אלה שיטות המשלוח שהגדרנו.
                                לא תמיד נצטרך את כולן, ובמקרים אחרים נצטרך כמה מכל אחת (אם קיימות מספר חברות משלוחים עם תוכניות ועלויות שונות, מספר נקודות איסוף וכו').
                                <ul>
                                    <li>
                                        אפשר לבחור כאן אם להפעיל או לכבות שיטת משלוח. נכבה שיטה שלא נמצאת בשימוש עוד אבל נצטרך אותה שוב בהמשך.
                                    </li>
                                    <li>
                                        נשמור את כל השינויים בכפתור 'שמירת שינויים' למטה.
                                    </li>                                                                 
                                </ul>
                            </li>
                            <img className='post-screenshot' src={p9} alt="screenshot-guide"/> 
                            <li>
                                <strong>
                                    כך זה יראה אצל הלקוח בסל הקניות
                                </strong>
                                <br/>
                                לאחר שמילא את כתובתו, המערכת זיהתה והציעה לו את שיטות המשלוח הרלוונטיות למדינת ירדן.
                                <br/>
                                המערכת גם מזהה את סכום הרכישה – זאת אומרת שלפי ההגדרות שלנו, אם היה קונה בפחות מ200₪, שיטת 'משלוח חינם' לא היתה מופיעה אצלו באופציות.
                            </li>
                            <img className='post-screenshot-small' src={p10} alt="screenshot-guide"/> 
                        </ol>
                        
                        <br/>
                        <br/>
                        <h5>הסתבכת קצת? אני כאן 😊 </h5>
                    </div>
                </Fade>
        </>
    )
}
